src/cf/DataProcessors/ЗагрузкаМодуляМенеджера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаМодуляМенеджера</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конвертация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конвертации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьОтсутствующиеАлгоритмы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПОД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПКПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыКонвертации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьНовуюКонвертацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьНовуюКонфигурацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьРасхожденияВПравилах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеФайловНаКлиенте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМенеджераКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьМетаданные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузкаМодуляМенеджера/Forms/ФормаВыборКонвертации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КопироватьДанныеФормы(ВладелецФормы.Объект, Объект);
	ИмяНовойКонвертации = ВладелецФормы.ИмяНовойКонвертации;
	ИмяНовойКонфигурации = ВладелецФормы.ИмяНовойКонфигурации; 

	Если ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ПереключательКонвертация = 1;
	ИначеЕсли Объект.СоздатьНовуюКонвертацию Тогда
		ПереключательКонвертация = 0;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Релиз) Тогда
		ПереключательКонфигурация = 1;
	ИначеЕсли Объект.СоздатьНовуюКонфигурацию Тогда
		ПереключательКонфигурация = 0;
	КонецЕсли;
	УправлениеДоступностью();
КонецПроцедуры
#КонецОбласти 
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УправлениеДоступностью()
	Элементы.ГруппаКонфигурация.Доступность = Истина;
	Если ПереключательКонвертация = 0 Тогда
		Элементы.Группа4.Доступность = Истина;
		Элементы.Группа2.Доступность = Истина;
	Иначе
		Элементы.Группа4.Доступность = Ложь;
		Элементы.Группа2.Доступность = Истина;
	КонецЕсли;
	Элементы.Конвертация.Доступность = (ПереключательКонвертация = 1);
	Элементы.Релиз.Доступность = (ПереключательКонфигурация = 1) И (ПереключательКонвертация = 0);
	Элементы.ОбновлятьМетаданные.Доступность = (ПереключательКонфигурация = 1);
	Элементы.ИмяНовойКонвертации.Доступность = (ПереключательКонвертация = 0);
	Элементы.ИмяНовойКонфигурации.Доступность = (ПереключательКонфигурация = 0 И ПереключательКонвертация = 0);  
	Элементы.ПоказыватьРасхожденияВПравилах.Доступность = (ПереключательКонвертация = 1);
КонецПроцедуры


&НаКлиенте
Процедура КонвертацияПриИзменении(Элемент)
	ОбновитьРелиз(); 
	ПереключательКонфигурация = 1; 
	ИмяНовойКонфигурации = "";
	Объект.ПоказыватьРасхожденияВПравилах = Истина;
	УправлениеДоступностью();
КонецПроцедуры 

&НаСервере
Процедура ОбновитьРелиз() 
	Если ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Конвертация, "Конфигурация, Наименование"); 
		Объект.Релиз = ДанныеКонвертации.Конфигурация; 
	Иначе
		Объект.Релиз = Справочники.Релизы.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РелизПриИзменении(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ДанныеЗаполнены = Ложь; 
	Объект.СоздатьНовуюКонфигурацию = (ПереключательКонфигурация = 0); 
	Объект.СоздатьНовуюКонвертацию = (ПереключательКонвертация = 0);

	ОписаниеРезультата = "";
	Если ЗначениеЗаполнено(Объект.Конвертация) Тогда
		//ОписаниеРезультата = НСтр("ru='Выполняется загрузка в конвертацию %1'");
		ОписаниеРезультата = НСтр("ru='Существующая конвертация %1 (%2)'");
		ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%1", СокрЛП(Объект.Конвертация));
		ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%2", ?(Объект.ОбновлятьМетаданные, НСтр("ru='с обновлением метаданных'"), НСтр("ru='без обновления метаданных'")));
		ДанныеЗаполнены = Истина; 
	ИначеЕсли Объект.СоздатьНовуюКонвертацию Тогда
		ОписаниеРезультата = НСтр("ru='Новая конвертация %1, конфигурация %2'");
		ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%1", СокрЛП(ИмяНовойКонвертации));
		Если ЗначениеЗаполнено(Объект.Релиз) Тогда
			ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%2", СокрЛП(Объект.Релиз) + ?(Объект.ОбновлятьМетаданные, НСтр("ru=' (с обновлением метаданных)'"), НСтр("ru=' (без обновления метаданных)'")));
			ДанныеЗаполнены = Истина; 
		ИначеЕсли Объект.СоздатьНовуюКонфигурацию Тогда
			ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "конфигурация", "новая конфигурация");  
			ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%2", СокрЛП(ИмяНовойКонфигурации));  
			ДанныеЗаполнены = Истина;
		КонецЕсли;
	КонецЕсли;  
	Если ДанныеЗаполнены = Ложь Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбрана конвертация для загрузки'")); 
		Возврат;
	КонецЕсли;
	Результат = Новый Структура("Конвертация, Релиз, СоздатьНовуюКонвертацию, СоздатьНовуюКонфигурацию, ПоказыватьРасхожденияВПравилах, ОбновлятьМетаданные");
	ЗаполнитьЗначенияСвойств(Результат, Объект);
	Результат.Вставить("ИмяНовойКонфигурации", ИмяНовойКонфигурации); 
	Результат.Вставить("ИмяНовойКонвертации", ИмяНовойКонвертации); 
	Результат.Вставить("ОписаниеРезультата", ОписаниеРезультата);
	Результат.Вставить("ЗагрузкаВСуществующуюКонвертацию", ЗначениеЗаполнено(Объект.Конвертация));
	Закрыть(Результат);

КонецПроцедуры


&НаКлиенте
Процедура ПереключателиПриИзменении(Элемент)
	Если ПереключательКонвертация = 0 Тогда
		Объект.Конвертация = ""; 
		Объект.ПоказыватьРасхожденияВПравилах = Ложь; 
	Иначе
		ИмяНовойКонвертации = "";
		ПереключательКонфигурация = 1;
	КонецЕсли;
	Если ПереключательКонфигурация = 0 Тогда
		Объект.Релиз = "";
	Иначе
		ИмяНовойКонфигурации = "";
	КонецЕсли;
	УправлениеДоступностью();
КонецПроцедуры

#КонецОбласти
